tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "ohueter/tap"
tap "riscv-software-src/riscv"
brew "bat"
brew "cmake"
brew "coursier"
brew "dos2unix"
brew "entr"
brew "eza"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "just"
brew "lazygit"
brew "lf"
brew "libomp"
brew "lua"
brew "luarocks"
brew "nasm"
brew "neovim"
brew "node"
brew "ocaml"
brew "opam"
brew "pandoc"
brew "premake"
brew "qemu"
brew "ripgrep"
brew "sdl2"
brew "sdl2_mixer"
brew "sqlite"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "typst"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zplug"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "ohueter/tap/autokbisw"
brew "riscv-software-src/riscv/riscv-tools"
cask "alacritty"
cask "alfred"
cask "arc"
cask "balenaetcher"
cask "betterdisplay"
cask "discord"
cask "dropzone"
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple"
cask "font-meslo-lg-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "inkscape"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kitty"
cask "logi-options-plus"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "miniconda"
cask "obsidian"
cask "postman"
cask "qbittorrent"
cask "racket"
cask "rectangle"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "telegram"
cask "thunderbird"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "webtorrent"
cask "wezterm"
cask "whatsapp"
cask "zed"
